svc-account/impl/src/test/resources/paymentResponseWithoutSummary.json

{
  "response": {
    "numFound": 12,
    "docs": [
      {
        "country": "US",
        "groupingId": 63911,
        "dateAdded": "2015-11-13T20:39:18+0000",
        "sellerId": 10040695,
        "dateLastModified": "2015-11-16T04:44:50+0000",
        "referenceNumber": "99M88263TK138600N",
        "id": 131698068,
        "payeeId": 10040695,
        "state": "DC",
        "jdkTimezone": "US/Eastern",
        "eventId": 9393940,
        "sellerPaymentStatusUserDefined": "Sent to PayPal",
        "bobId": 1,
        "eventName_en_US": "Grimes Tickets (Rescheduled from November 13, 2015)",
        "earliestPossibleInhandDate": "2015-09-15T18:13:34+0000",
        "transactionId": 188076297,
        "defaultLocale": "en_US",
        "venueName_en_US": "9:30 Club - Washington",
        "stubhubListingId": 1170329676,
        "ticketSection": "General Admission",
        "performerName_en_GB": "Grimes",
        "statsPaymentAmount": 67.5,
        "performerIdFacet": "584218|performer",
        "adjustmentAmount": 0,
        "ticketSeats": "General Admission",
        "eventDate": "2016-05-14T00:00:00+0000",
        "groupingName_en_GB": "Artists D - G",
        "groupingStatus": "active",
        "city": "Washington",
        "paymentCompletionDate": "2015-11-14T21:13:28+0000",
        "totalTicketPrice": 75,
        "locale": [
          "en_GB",
          "en_US"
        ],
        "paymentAmount": 67.5,
        "performerId": 584218,
        "latestPossibleInhandDate": "2016-05-07T00:00:00+0000",
        "performerStatus": "active",
        "payeeName": "10040695@testmail.com",
        "paymentTypeId": 1,
        "sellerPayoutAmount": 67.5,
        "venueId": 2222,
        "paymentCreatedDate": "2015-11-13T20:39:18+0000",
        "commission": 7.5,
        "paymentTypeUserDefined": "Paypal",
        "hideEventTime": "false",
        "sellerPaymentStatus": "14",
        "eventName_en_GB": "Grimes Tickets (Rescheduled from November 13, 2015)",
        "paymentTermId": 2,
        "ticketRowDesc": "N/A",
        "recordType": "Payment Voucher",
        "paymentCancelledInd": 0,
        "payeeEmailId": "10040695@testmail.com",
        "ticketQuantity": 1,
        "venueName_en_GB": "9:30 Club - Washington",
        "performerName_en_US": "Grimes",
        "cmApplied": 0,
        "eventDateLocal": "2016-05-13T20:00:00+0000",
        "eventStatus": "completed",
        "hideEventDate": "false",
        "groupingName_en_US": "Artists D G",
        "venueStatus": "active",
        "bankName": "bankName",
        "acctLastFourDigits": "1234",
        "currencyCode": "USD"
      },
      {
        "country": "US",
        "groupingId": 63911,
        "dateAdded": "2015-11-12T22:41:34+0000",
        "sellerId": 10040695,
        "dateLastModified": "2015-11-16T04:44:50+0000",
        "referenceNumber": "",
        "id": 131660464,
        "payeeId": 10040695,
        "state": "DC",
        "jdkTimezone": "US/Eastern",
        "eventId": 9393940,
        "sellerPaymentStatusUserDefined": "Sent to PayPal",
        "bobId": 1,
        "eventName_en_US": "Grimes Tickets (Rescheduled from November 13, 2015)",
        "earliestPossibleInhandDate": "2015-09-15T18:13:34+0000",
        "transactionId": 188089299,
        "defaultLocale": "en_US",
        "venueName_en_US": "9:30 Club - Washington",
        "stubhubListingId": 1170329676,
        "ticketSection": "General Admission",
        "performerName_en_GB": "Grimes",
        "statsPaymentAmount": 67.5,
        "performerIdFacet": "584218|performer",
        "adjustmentAmount": 0,
        "ticketSeats": "General Admission",
        "eventDate": "2016-05-14T00:00:00+0000",
        "groupingName_en_GB": "Artists D - G",
        "groupingStatus": "active",
        "city": "Washington",
        "paymentCompletionDate": "2015-11-14T02:26:24+0000",
        "totalTicketPrice": 75,
        "locale": [
          "en_GB",
          "en_US"
        ],
        "paymentAmount": 67.5,
        "performerId": 584218,
        "latestPossibleInhandDate": "2016-05-07T00:00:00+0000",
        "performerStatus": "active",
        "payeeName": "10040695@testmail.com",
        "paymentTypeId": null,
        "sellerPayoutAmount": 67.5,
        "venueId": 2222,
        "paymentCreatedDate": "2015-11-12T22:41:34+0000",
        "commission": 7.5,
        "paymentTypeUserDefined": "Paypal",
        "hideEventTime": "false",
        "sellerPaymentStatus": "14",
        "eventName_en_GB": "Grimes Tickets (Rescheduled from November 13, 2015)",
        "paymentTermId": 2,
        "ticketRowDesc": "N/A",
        "recordType": "Payment Voucher",
        "paymentCancelledInd": 0,
        "payeeEmailId": "10040695@testmail.com",
        "ticketQuantity": 1,
        "venueName_en_GB": "9:30 Club - Washington",
        "performerName_en_US": "Grimes",
        "cmApplied": null,
        "disbursementOptionId" : 1,
        "paypalPaymentEmail": "paypalPaymentEmail",
        "eventDateLocal": "2016-05-13T20:00:00+0000",
        "eventStatus": "completed",
        "hideEventDate": "false",
        "groupingName_en_US": "Artists D G",
        "venueStatus": "active",
        "currencyCode": "USD"
      },
      {
        "currencyCode": "USD",
        "paymentTypeId": 11111,
        "eventNameSort": "eventNameSort"
      }
    ],
    "aggregations": {
      }
    }
  }
}